org/dsa/grind-75.org
# -*- org-hugo-section: "dsa/grind-75" -*-
* Grind 75
:PROPERTIES:
:EXPORT_FILE_NAME: _index
:END:

** DONE Two Sum :array:hashing:easy:
CLOSED: [2022-07-17 Sun]
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: two-sum
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/two-sum

#+begin_src cpp
class Solution {
public:
    vector<int> twoSum(vector<int>& nums, int target) {
        map<int, int> mp;

        vector<int> ans(2);

        for (int i = 0; i < nums.size(); i++) {
            if (mp.find(target - nums[i]) != mp.end()) {
                ans[0] = i;
                ans[1] = mp[target-nums[i]];
            } else {
                mp.insert({nums[i], i});
            }
        }

        return ans;
    }
};
#+end_src

** DONE Valid Parentheses :stack:easy:
CLOSED: [2022-07-17 Sun]
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: valid-parentheses
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/valid-parentheses

#+begin_src cpp
class Solution {
public:
    bool isValid(string s) {
        stack<char> st;

        for (auto c: s) {
            if (c == '}' && !st.empty()) {
                if (st.top() == '{') {
                    st.pop();
                } else st.push(c);
            }
            else if (c == ')' && !st.empty()) {
                if (st.top() == '(') {
                    st.pop();
                } else st.push(c);
            }
            else if (c == ']' && !st.empty()) {
                if (st.top() == '[') {
                    st.pop();
                } else st.push(c);
            } else {
                st.push(c);
            }
        }

        return st.empty();
    }
};
#+end_src

** TODO Merge Two Sorted Lists :ll:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: merge-two-sorted-lists
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/merge-two-sorted-lists
** TODO Best Time to Buy and Sell Stock :array:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: best-time-to-buy-and-sell-stock
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/best-time-to-buy-and-sell-stock
** TODO Valid Palindrome :string:palindrome:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: valid-palindrome
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/valid-palindrome
** TODO Invert Binary Tree :bt:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: invert-binary-tree
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/invert-binary-tree
** TODO Valid Anagram :string:anagram:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: valid-anagram
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/valid-anagram
** TODO Binary Search :binarysearch:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: binarysearch
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/binarysearch
** TODO Flood Fill :graph:matrix:dfs:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: flood-fill
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/flood-fill
** TODO Maximum Subarray :dp:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: maximum-subarray
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/maximum-subarray
** TODO Lowest Common Ancestor of a Binary Search Tree :bst:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: lowest-common-ancestor-of-a-bst
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/lowest-common-ancestor-of-a-bst
** TODO Balanced Binary Tree :bt:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: balanced-binary-tree
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/balanced-binary-tree
** TODO Linked List Cycle :ll:twopointers:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: linked-list-cycle
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/linked-list-cycle
** TODO Implement Queue using Stacks :stack:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: implement-queue-using-stacks
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/implement-queue-using-stacks
** TODO First Bad Version :binarysearch:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: first-bad-version
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/first-bad-version
** TODO Ransom Note :hashtable:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: ransom-note
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/ransom-note
** TODO Climbing Stairs :dp:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: climbing-stairs
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/climbing-stairs
** TODO Longest Palindrome :string:palindrome:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: longest-palindrome
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/longest-palindrome
** TODO Reverse Linked List :ll:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: reverse-linked-list
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/reverse-linked-list
** TODO Majority Element :array:sorting:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: majority-element
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/majority-element
** TODO Add Binary :binary:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: add-binary
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/add-binary
** TODO Diameter of Binary Tree :bt:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: diameter-of-binary-tree
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/diameter-of-binary-tree
** TODO Middle of the Linked List :ll:twopointers:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: middle-of-the-linked-list
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/middle-of-the-linked-list
** TODO Maximum Depth of Binary Tree :bt:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: maximum-depth-of-binary-tree
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/maximum-depth-of-binary-tree
** TODO Contains Duplicate :array:hashtable:sorting:easy:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: contains-duplicate
:Effort: 15
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 15
:END:
https://leetcode.com/problems/contains-duplicate
** TODO Min Stack :stack:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: min-stack
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/min-stack
** TODO Insert Interval :array:interval:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: insert-interval
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/insert-interval
** TODO 01 Matrix :graph:dfs:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: 01-matrix
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/01-matrix
** TODO K Closest Points to Origin :heap:geometry:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: k-closest-points-to-origin
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/k-closest-points-to-origin
