content/dsa/grind-75/_index.md
+++
title = "Grind 75"
author = ["Seshal Jain"]
draft = false
+++

## <span class="org-todo done DONE">DONE</span> Two Sum <span class="tag"><span class="array">array</span><span class="hashing">hashing</span><span class="easy">easy</span></span> {#two-sum}

<https://leetcode.com/problems/two-sum>


## <span class="org-todo todo TODO">TODO</span> Valid Parentheses <span class="tag"><span class="stack">stack</span><span class="easy">easy</span></span> {#valid-parentheses}

<https://leetcode.com/problems/valid-parentheses>


## <span class="org-todo todo TODO">TODO</span> Merge Two Sorted Lists <span class="tag"><span class="ll">ll</span><span class="easy">easy</span></span> {#merge-two-sorted-lists}

<https://leetcode.com/problems/merge-two-sorted-lists>


## <span class="org-todo todo TODO">TODO</span> Best Time to Buy and Sell Stock <span class="tag"><span class="array">array</span><span class="easy">easy</span></span> {#best-time-to-buy-and-sell-stock}

<https://leetcode.com/problems/best-time-to-buy-and-sell-stock>


## <span class="org-todo todo TODO">TODO</span> Valid Palindrome <span class="tag"><span class="string">string</span><span class="palindrome">palindrome</span><span class="easy">easy</span></span> {#valid-palindrome}

<https://leetcode.com/problems/valid-palindrome>


## <span class="org-todo todo TODO">TODO</span> Invert Binary Tree <span class="tag"><span class="bt">bt</span><span class="easy">easy</span></span> {#invert-binary-tree}

<https://leetcode.com/problems/invert-binary-tree>


## <span class="org-todo todo TODO">TODO</span> Valid Anagram <span class="tag"><span class="string">string</span><span class="anagram">anagram</span><span class="easy">easy</span></span> {#valid-anagram}

<https://leetcode.com/problems/valid-anagram>


## <span class="org-todo todo TODO">TODO</span> Binary Search <span class="tag"><span class="binarysearch">binarysearch</span><span class="easy">easy</span></span> {#binarysearch}

<https://leetcode.com/problems/binarysearch>


## <span class="org-todo todo TODO">TODO</span> Flood Fill <span class="tag"><span class="graph">graph</span><span class="matrix">matrix</span><span class="dfs">dfs</span><span class="easy">easy</span></span> {#flood-fill}

<https://leetcode.com/problems/flood-fill>


## <span class="org-todo todo TODO">TODO</span> Maximum Subarray <span class="tag"><span class="dp">dp</span><span class="easy">easy</span></span> {#maximum-subarray}

<https://leetcode.com/problems/maximum-subarray>


## <span class="org-todo todo TODO">TODO</span> Lowest Common Ancestor of a Binary Search Tree <span class="tag"><span class="bst">bst</span><span class="easy">easy</span></span> {#lowest-common-ancestor-of-a-bst}

<https://leetcode.com/problems/lowest-common-ancestor-of-a-bst>


## <span class="org-todo todo TODO">TODO</span> Balanced Binary Tree <span class="tag"><span class="bt">bt</span><span class="easy">easy</span></span> {#balanced-binary-tree}

<https://leetcode.com/problems/balanced-binary-tree>


## <span class="org-todo todo TODO">TODO</span> Linked List Cycle <span class="tag"><span class="ll">ll</span><span class="twopointers">twopointers</span><span class="easy">easy</span></span> {#linked-list-cycle}

<https://leetcode.com/problems/linked-list-cycle>


## <span class="org-todo todo TODO">TODO</span> Implement Queue using Stacks <span class="tag"><span class="stack">stack</span><span class="easy">easy</span></span> {#implement-queue-using-stacks}

<https://leetcode.com/problems/implement-queue-using-stacks>


## <span class="org-todo todo TODO">TODO</span> First Bad Version <span class="tag"><span class="binarysearch">binarysearch</span><span class="easy">easy</span></span> {#first-bad-version}

<https://leetcode.com/problems/first-bad-version>


## <span class="org-todo todo TODO">TODO</span> Ransom Note <span class="tag"><span class="hashtable">hashtable</span><span class="easy">easy</span></span> {#ransom-note}

<https://leetcode.com/problems/ransom-note>


## <span class="org-todo todo TODO">TODO</span> Climbing Stairs <span class="tag"><span class="dp">dp</span><span class="easy">easy</span></span> {#climbing-stairs}

<https://leetcode.com/problems/climbing-stairs>


## <span class="org-todo todo TODO">TODO</span> Longest Palindrome <span class="tag"><span class="string">string</span><span class="palindrome">palindrome</span><span class="easy">easy</span></span> {#longest-palindrome}

<https://leetcode.com/problems/longest-palindrome>


## <span class="org-todo todo TODO">TODO</span> Reverse Linked List <span class="tag"><span class="ll">ll</span><span class="easy">easy</span></span> {#reverse-linked-list}

<https://leetcode.com/problems/reverse-linked-list>


## <span class="org-todo todo TODO">TODO</span> Majority Element <span class="tag"><span class="array">array</span><span class="sorting">sorting</span><span class="easy">easy</span></span> {#majority-element}

<https://leetcode.com/problems/majority-element>


## <span class="org-todo todo TODO">TODO</span> Add Binary <span class="tag"><span class="binary">binary</span><span class="easy">easy</span></span> {#add-binary}

<https://leetcode.com/problems/add-binary>


## <span class="org-todo todo TODO">TODO</span> Diameter of Binary Tree <span class="tag"><span class="bt">bt</span><span class="easy">easy</span></span> {#diameter-of-binary-tree}

<https://leetcode.com/problems/diameter-of-binary-tree>


## <span class="org-todo todo TODO">TODO</span> Middle of the Linked List <span class="tag"><span class="ll">ll</span><span class="twopointers">twopointers</span><span class="easy">easy</span></span> {#middle-of-the-linked-list}

<https://leetcode.com/problems/middle-of-the-linked-list>


## <span class="org-todo todo TODO">TODO</span> Maximum Depth of Binary Tree <span class="tag"><span class="bt">bt</span><span class="easy">easy</span></span> {#maximum-depth-of-binary-tree}

<https://leetcode.com/problems/maximum-depth-of-binary-tree>


## <span class="org-todo todo TODO">TODO</span> Contains Duplicate <span class="tag"><span class="array">array</span><span class="hashtable">hashtable</span><span class="sorting">sorting</span><span class="easy">easy</span></span> {#contains-duplicate}

<https://leetcode.com/problems/contains-duplicate>


## <span class="org-todo todo TODO">TODO</span> Min Stack <span class="tag"><span class="stack">stack</span><span class="medium">medium</span></span> {#min-stack}

<https://leetcode.com/problems/min-stack>


## <span class="org-todo todo TODO">TODO</span> Insert Interval <span class="tag"><span class="array">array</span><span class="interval">interval</span><span class="medium">medium</span></span> {#insert-interval}

<https://leetcode.com/problems/insert-interval>


## <span class="org-todo todo TODO">TODO</span> 01 Matrix <span class="tag"><span class="graph">graph</span><span class="dfs">dfs</span><span class="medium">medium</span></span> {#01-matrix}

<https://leetcode.com/problems/01-matrix>


## <span class="org-todo todo TODO">TODO</span> K Closest Points to Origin <span class="tag"><span class="heap">heap</span><span class="geometry">geometry</span><span class="medium">medium</span></span> {#k-closest-points-to-origin}

<https://leetcode.com/problems/k-closest-points-to-origin>
