org/dsa/grind-75.org
** TODO Longest Substring Without Repeating Characters :string:slidingwindow:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: longest-substring-without-repeating-characters
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/longest-substring-without-repeating-characters
** TODO 3Sum :array:twopointers:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: 3sum
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/3sum
** TODO Binary Tree Level Order Traversal :bt:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: binary-tree-level-order-traversal
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/binary-tree-level-order-traversal
** TODO Clone Graph :graph:dfs:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: clone-graph
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/clone-graph
** TODO Evaluate Reverse Polish Notation :stack:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: evaluate-reverse-polish-notation
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/evaluate-reverse-polish-notation
** TODO Course Schedule :graph:toposort:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: course-schedule
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/course-schedule
** TODO Implement Trie (Prefix Tree) :trie:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: implement-trie-prefix-tree
:Effort: 35
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 35
:END:
https://leetcode.com/problems/implement-trie-prefix-tree
** TODO Coin Change :dp:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: coin-change
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/coin-change
** TODO Product of Array Except Self :array:prefixsum:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: product-of-array-except-self
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/product-of-array-except-self
** TODO Validate Binary Search Tree :bst:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: validate-bst
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/validate-bst
** TODO Number of Islands :graph:dfs:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: number-of-islands
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/number-of-islands
** TODO Rotting Oranges :graph:dfs:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: rotting-oranges
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/rotting-oranges
** TODO Search in Rotated Sorted Array :binarysearch:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: search-in-rotated-sorted-array
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/search-in-rotated-sorted-array
** TODO Combination Sum :array:backtracking:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: combination-sum
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/combination-sum
** TODO Permutations :recursion:backtracking:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: permutations
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/permutations
** TODO Merge Intervals :array:interval:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: merge-intervals
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/merge-intervals
** TODO Lowest Common Ancestor of a Binary Tree :bt:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: lowest-common-ancestor-of-a-binary-tree
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/lowest-common-ancestor-of-a-binary-tree
** TODO Time Based Key-Value Store :binarysearch:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: time-based-key-value-store
:Effort: 35
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 35
:END:
https://leetcode.com/problems/time-based-key-value-store
** TODO Accounts Merge :graph:dfs:unionfind:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: accounts-merge
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/accounts-merge
** TODO Sort Colors :array:twopointers:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: sort-colors
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/sort-colors
** TODO Word Break :trie:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: word-break
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/word-break
** TODO Partition Equal Subset Sum :dp:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: partition-equal-subset-sum
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/partition-equal-subset-sum
** TODO String to Integer (atoi) :string:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: string-to-integer-atoi
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/string-to-integer-atoi
** TODO Spiral Matrix :matrix:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: spiral-matrix
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/spiral-matrix
** TODO Subsets :recursion:backtracking:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: subsets
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/subsets
** TODO Binary Tree Right Side View :bt:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: binary-tree-right-side-view
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/binary-tree-right-side-view
** TODO Longest Palindromic Substring :string:palindrome:twopointer:dp:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: longest-palindromic-substring
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/longest-palindromic-substring
** TODO Unique Paths :dp:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: unique-paths
:Effort: 20
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 20
:END:
https://leetcode.com/problems/unique-paths
** TODO Construct Binary Tree from Preorder and Inorder Traversal :bt:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: construct-binary-tree-from-preorder-and-inorder-traversal
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/construct-binary-tree-from-preorder-and-inorder-traversal
** TODO Container With Most Water :array:greedy:twopointers:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: container-with-most-water
:Effort: 35
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 35
:END:
https://leetcode.com/problems/container-with-most-water
