content/dsa/grind-75/_index.md


## <span class="org-todo todo TODO">TODO</span> Longest Substring Without Repeating Characters <span class="tag"><span class="string">string</span><span class="slidingwindow">slidingwindow</span><span class="medium">medium</span></span> {#longest-substring-without-repeating-characters}

<https://leetcode.com/problems/longest-substring-without-repeating-characters>


## <span class="org-todo todo TODO">TODO</span> 3Sum <span class="tag"><span class="array">array</span><span class="twopointers">twopointers</span><span class="medium">medium</span></span> {#3sum}

<https://leetcode.com/problems/3sum>


## <span class="org-todo todo TODO">TODO</span> Binary Tree Level Order Traversal <span class="tag"><span class="bt">bt</span><span class="medium">medium</span></span> {#binary-tree-level-order-traversal}

<https://leetcode.com/problems/binary-tree-level-order-traversal>


## <span class="org-todo todo TODO">TODO</span> Clone Graph <span class="tag"><span class="graph">graph</span><span class="dfs">dfs</span><span class="medium">medium</span></span> {#clone-graph}

<https://leetcode.com/problems/clone-graph>


## <span class="org-todo todo TODO">TODO</span> Evaluate Reverse Polish Notation <span class="tag"><span class="stack">stack</span><span class="medium">medium</span></span> {#evaluate-reverse-polish-notation}

<https://leetcode.com/problems/evaluate-reverse-polish-notation>


## <span class="org-todo todo TODO">TODO</span> Course Schedule <span class="tag"><span class="graph">graph</span><span class="toposort">toposort</span><span class="medium">medium</span></span> {#course-schedule}

<https://leetcode.com/problems/course-schedule>


## <span class="org-todo todo TODO">TODO</span> Implement Trie (Prefix Tree) <span class="tag"><span class="trie">trie</span><span class="medium">medium</span></span> {#implement-trie-prefix-tree}

<https://leetcode.com/problems/implement-trie-prefix-tree>


## <span class="org-todo todo TODO">TODO</span> Coin Change <span class="tag"><span class="dp">dp</span><span class="medium">medium</span></span> {#coin-change}

<https://leetcode.com/problems/coin-change>


## <span class="org-todo todo TODO">TODO</span> Product of Array Except Self <span class="tag"><span class="array">array</span><span class="prefixsum">prefixsum</span><span class="medium">medium</span></span> {#product-of-array-except-self}

<https://leetcode.com/problems/product-of-array-except-self>


## <span class="org-todo todo TODO">TODO</span> Validate Binary Search Tree <span class="tag"><span class="bst">bst</span><span class="medium">medium</span></span> {#validate-bst}

<https://leetcode.com/problems/validate-bst>


## <span class="org-todo todo TODO">TODO</span> Number of Islands <span class="tag"><span class="graph">graph</span><span class="dfs">dfs</span><span class="medium">medium</span></span> {#number-of-islands}

<https://leetcode.com/problems/number-of-islands>


## <span class="org-todo todo TODO">TODO</span> Rotting Oranges <span class="tag"><span class="graph">graph</span><span class="dfs">dfs</span><span class="medium">medium</span></span> {#rotting-oranges}

<https://leetcode.com/problems/rotting-oranges>


## <span class="org-todo todo TODO">TODO</span> Search in Rotated Sorted Array <span class="tag"><span class="binarysearch">binarysearch</span><span class="medium">medium</span></span> {#search-in-rotated-sorted-array}

<https://leetcode.com/problems/search-in-rotated-sorted-array>


## <span class="org-todo todo TODO">TODO</span> Combination Sum <span class="tag"><span class="array">array</span><span class="backtracking">backtracking</span><span class="medium">medium</span></span> {#combination-sum}

<https://leetcode.com/problems/combination-sum>


## <span class="org-todo todo TODO">TODO</span> Permutations <span class="tag"><span class="recursion">recursion</span><span class="backtracking">backtracking</span><span class="medium">medium</span></span> {#permutations}

<https://leetcode.com/problems/permutations>


## <span class="org-todo todo TODO">TODO</span> Merge Intervals <span class="tag"><span class="array">array</span><span class="interval">interval</span><span class="medium">medium</span></span> {#merge-intervals}

<https://leetcode.com/problems/merge-intervals>


## <span class="org-todo todo TODO">TODO</span> Lowest Common Ancestor of a Binary Tree <span class="tag"><span class="bt">bt</span><span class="medium">medium</span></span> {#lowest-common-ancestor-of-a-binary-tree}

<https://leetcode.com/problems/lowest-common-ancestor-of-a-binary-tree>


## <span class="org-todo todo TODO">TODO</span> Time Based Key-Value Store <span class="tag"><span class="binarysearch">binarysearch</span><span class="medium">medium</span></span> {#time-based-key-value-store}

<https://leetcode.com/problems/time-based-key-value-store>


## <span class="org-todo todo TODO">TODO</span> Accounts Merge <span class="tag"><span class="graph">graph</span><span class="dfs">dfs</span><span class="unionfind">unionfind</span><span class="medium">medium</span></span> {#accounts-merge}

<https://leetcode.com/problems/accounts-merge>


## <span class="org-todo todo TODO">TODO</span> Sort Colors <span class="tag"><span class="array">array</span><span class="twopointers">twopointers</span><span class="medium">medium</span></span> {#sort-colors}

<https://leetcode.com/problems/sort-colors>


## <span class="org-todo todo TODO">TODO</span> Word Break <span class="tag"><span class="trie">trie</span><span class="medium">medium</span></span> {#word-break}

<https://leetcode.com/problems/word-break>


## <span class="org-todo todo TODO">TODO</span> Partition Equal Subset Sum <span class="tag"><span class="dp">dp</span><span class="medium">medium</span></span> {#partition-equal-subset-sum}

<https://leetcode.com/problems/partition-equal-subset-sum>


## <span class="org-todo todo TODO">TODO</span> String to Integer (atoi) <span class="tag"><span class="string">string</span><span class="medium">medium</span></span> {#string-to-integer-atoi}

<https://leetcode.com/problems/string-to-integer-atoi>


## <span class="org-todo todo TODO">TODO</span> Spiral Matrix <span class="tag"><span class="matrix">matrix</span><span class="medium">medium</span></span> {#spiral-matrix}

<https://leetcode.com/problems/spiral-matrix>


## <span class="org-todo todo TODO">TODO</span> Subsets <span class="tag"><span class="recursion">recursion</span><span class="backtracking">backtracking</span><span class="medium">medium</span></span> {#subsets}

<https://leetcode.com/problems/subsets>


## <span class="org-todo todo TODO">TODO</span> Binary Tree Right Side View <span class="tag"><span class="bt">bt</span><span class="medium">medium</span></span> {#binary-tree-right-side-view}

<https://leetcode.com/problems/binary-tree-right-side-view>


## <span class="org-todo todo TODO">TODO</span> Longest Palindromic Substring <span class="tag"><span class="string">string</span><span class="palindrome">palindrome</span><span class="twopointer">twopointer</span><span class="dp">dp</span><span class="medium">medium</span></span> {#longest-palindromic-substring}

<https://leetcode.com/problems/longest-palindromic-substring>


## <span class="org-todo todo TODO">TODO</span> Unique Paths <span class="tag"><span class="dp">dp</span><span class="medium">medium</span></span> {#unique-paths}

<https://leetcode.com/problems/unique-paths>


## <span class="org-todo todo TODO">TODO</span> Construct Binary Tree from Preorder and Inorder Traversal <span class="tag"><span class="bt">bt</span><span class="medium">medium</span></span> {#construct-binary-tree-from-preorder-and-inorder-traversal}

<https://leetcode.com/problems/construct-binary-tree-from-preorder-and-inorder-traversal>


## <span class="org-todo todo TODO">TODO</span> Container With Most Water <span class="tag"><span class="array">array</span><span class="greedy">greedy</span><span class="twopointers">twopointers</span><span class="medium">medium</span></span> {#container-with-most-water}

<https://leetcode.com/problems/container-with-most-water>
