org/dsa/grind-75.org
** TODO Letter Combinations of a Phone Number :recursion:backtracking:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: letter-combinations-of-a-phone-number
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/letter-combinations-of-a-phone-number
** TODO Word Search :graph:backtracking:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: word-search
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/word-search
** TODO Find All Anagrams in a String :string:anagram:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: find-all-anagrams-in-a-string
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/find-all-anagrams-in-a-string
** TODO Minimum Height Trees :graph:toposort:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: minimum-height-trees
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/minimum-height-trees
** TODO Task Scheduler :heap:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: task-scheduler
:Effort: 35
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 35
:END:
https://leetcode.com/problems/task-scheduler
** TODO LRU Cache :ll:hashtable:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: lru-cache
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/lru-cache
** TODO Kth Smallest Element in a BST :bst:medium:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: kth-smallest-element-in-a-bst
:Effort: 25
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 25
:END:
https://leetcode.com/problems/kth-smallest-element-in-a-bst
** TODO Minimum Window Substring :string:slidingwindow:hard:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: minimum-window-substring
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/minimum-window-substring
** TODO Serialize and Deserialize Binary Tree :bt:hard:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: serialize-and-deserialize-binary-tree
:Effort: 40
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 40
:END:
https://leetcode.com/problems/serialize-and-deserialize-binary-tree
** TODO Trapping Rain Water :stack:monotonicstack:hard:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: trapping-rain-water
:Effort: 35
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 35
:END:
https://leetcode.com/problems/trapping-rain-water
** TODO Find Median from Data Stream :heap:hard:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: find-median-from-data-stream
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/find-median-from-data-stream
** TODO Word Ladder :graph:dfs:hard:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: word-ladder
:Effort: 45
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 45
:END:
https://leetcode.com/problems/word-ladder
** TODO Basic Calculator :stack:parsing:hard:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: basic-calculator
:Effort: 40
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 40
:END:
https://leetcode.com/problems/basic-calculator
** TODO Maximum Profit in Job Scheduling :binarysearch:dp:hard:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: maximum-profit-in-job-scheduling
:Effort: 45
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 45
:END:
https://leetcode.com/problems/maximum-profit-in-job-scheduling
** TODO Merge k Sorted Lists :heap:hard:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: merge-k-sorted-lists
:Effort: 30
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 30
:END:
https://leetcode.com/problems/merge-k-sorted-lists
** TODO Largest Rectangle in Histogram :stack:monoticstack:hard:
:PROPERTIES:
:EXPORT_HUGO_WEIGHT: auto
:EXPORT_FILE_NAME: largest-rectangle-in-histogram
:Effort: 35
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :duration 35
:END:
https://leetcode.com/problems/largest-rectangle-in-histogram
