content/dsa/grind-75/_index.md


## <span class="org-todo todo TODO">TODO</span> Letter Combinations of a Phone Number <span class="tag"><span class="recursion">recursion</span><span class="backtracking">backtracking</span><span class="medium">medium</span></span> {#letter-combinations-of-a-phone-number}

<https://leetcode.com/problems/letter-combinations-of-a-phone-number>


## <span class="org-todo todo TODO">TODO</span> Word Search <span class="tag"><span class="graph">graph</span><span class="backtracking">backtracking</span><span class="medium">medium</span></span> {#word-search}

<https://leetcode.com/problems/word-search>


## <span class="org-todo todo TODO">TODO</span> Find All Anagrams in a String <span class="tag"><span class="string">string</span><span class="anagram">anagram</span><span class="medium">medium</span></span> {#find-all-anagrams-in-a-string}

<https://leetcode.com/problems/find-all-anagrams-in-a-string>


## <span class="org-todo todo TODO">TODO</span> Minimum Height Trees <span class="tag"><span class="graph">graph</span><span class="toposort">toposort</span><span class="medium">medium</span></span> {#minimum-height-trees}

<https://leetcode.com/problems/minimum-height-trees>


## <span class="org-todo todo TODO">TODO</span> Task Scheduler <span class="tag"><span class="heap">heap</span><span class="medium">medium</span></span> {#task-scheduler}

<https://leetcode.com/problems/task-scheduler>


## <span class="org-todo todo TODO">TODO</span> LRU Cache <span class="tag"><span class="ll">ll</span><span class="hashtable">hashtable</span><span class="medium">medium</span></span> {#lru-cache}

<https://leetcode.com/problems/lru-cache>


## <span class="org-todo todo TODO">TODO</span> Kth Smallest Element in a BST <span class="tag"><span class="bst">bst</span><span class="medium">medium</span></span> {#kth-smallest-element-in-a-bst}

<https://leetcode.com/problems/kth-smallest-element-in-a-bst>


## <span class="org-todo todo TODO">TODO</span> Minimum Window Substring <span class="tag"><span class="string">string</span><span class="slidingwindow">slidingwindow</span><span class="hard">hard</span></span> {#minimum-window-substring}

<https://leetcode.com/problems/minimum-window-substring>


## <span class="org-todo todo TODO">TODO</span> Serialize and Deserialize Binary Tree <span class="tag"><span class="bt">bt</span><span class="hard">hard</span></span> {#serialize-and-deserialize-binary-tree}

<https://leetcode.com/problems/serialize-and-deserialize-binary-tree>


## <span class="org-todo todo TODO">TODO</span> Trapping Rain Water <span class="tag"><span class="stack">stack</span><span class="monotonicstack">monotonicstack</span><span class="hard">hard</span></span> {#trapping-rain-water}

<https://leetcode.com/problems/trapping-rain-water>


## <span class="org-todo todo TODO">TODO</span> Find Median from Data Stream <span class="tag"><span class="heap">heap</span><span class="hard">hard</span></span> {#find-median-from-data-stream}

<https://leetcode.com/problems/find-median-from-data-stream>


## <span class="org-todo todo TODO">TODO</span> Word Ladder <span class="tag"><span class="graph">graph</span><span class="dfs">dfs</span><span class="hard">hard</span></span> {#word-ladder}

<https://leetcode.com/problems/word-ladder>


## <span class="org-todo todo TODO">TODO</span> Basic Calculator <span class="tag"><span class="stack">stack</span><span class="parsing">parsing</span><span class="hard">hard</span></span> {#basic-calculator}

<https://leetcode.com/problems/basic-calculator>


## <span class="org-todo todo TODO">TODO</span> Maximum Profit in Job Scheduling <span class="tag"><span class="binarysearch">binarysearch</span><span class="dp">dp</span><span class="hard">hard</span></span> {#maximum-profit-in-job-scheduling}

<https://leetcode.com/problems/maximum-profit-in-job-scheduling>


## <span class="org-todo todo TODO">TODO</span> Merge k Sorted Lists <span class="tag"><span class="heap">heap</span><span class="hard">hard</span></span> {#merge-k-sorted-lists}

<https://leetcode.com/problems/merge-k-sorted-lists>


## <span class="org-todo todo TODO">TODO</span> Largest Rectangle in Histogram <span class="tag"><span class="stack">stack</span><span class="monoticstack">monoticstack</span><span class="hard">hard</span></span> {#largest-rectangle-in-histogram}

<https://leetcode.com/problems/largest-rectangle-in-histogram>
